# Data  Importation, Cleaning and Wrangling with Pandas.

### Data importation and inspection

Data can be imported from different sources for analysis.
Different data sources have different ways to import data using pandas.
This section of the notebook demonstrates how to import csv,and excel files

#### csv
To import a csv file with pandas, use the format below:

df = pd.read_csv(file path,sep,delimiter,header, names,index_col,usecols,parse_dates,....)

#### excel file(xlsx) spreadsheet
 df = pd.read_excel(file path,sheet_name, header,name,index_col,usecols,skiprows,nrows.....)
 
#### excel file


### Data saving

#### csv
to_csv : Write DataFrame to a comma-separated values (csv) file.

#### excel file

to_excel : Write DataFrame to an Excel file.

# Note: 

### For easy data importation, make sure your data is in your working directory.

# Demo:

In [1]:
# import the necessary packages
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# Checking the cuurent working directory
os.getcwd()

'C:\\Users\\oabas\\Documents\\GitHub\\Introduction_to_Data_Science\\Blossom Academy Fellowship\\EDA\\Data Manipulation with Pandas'

##### Listing all files in the current working directory

In [3]:
ls

 Volume in drive C is OS
 Volume Serial Number is 5821-3AE8

 Directory of C:\Users\oabas\Documents\GitHub\Introduction_to_Data_Science\Blossom Academy Fellowship\EDA\Data Manipulation with Pandas

11/06/2022  10:43    <DIR>          .
11/06/2022  10:39    <DIR>          ..
11/06/2022  10:39    <DIR>          .ipynb_checkpoints
11/06/2022  10:41    <DIR>          data
11/06/2022  10:43           248,768 Data Importation,Inspection,Indexing and Cleaning with Pandas.ipynb
               1 File(s)        248,768 bytes
               4 Dir(s)  14,048,120,832 bytes free

### importing a csv file

In [4]:
df = pd.read_csv('data/nyc_weather.csv')

In [5]:
data = pd.read_csv('data/life_data.csv')
data.head()

,country,continent,year,lifeExp,pop,gdpPercap,iso_alpha,iso_num
0,Afghanistan,Asia,1952,28.801,8425333,779.445314,AFG,4
1,Afghanistan,Asia,1957,30.332,9240934,820.853030,AFG,4
2,Afghanistan,Asia,1962,31.997,10267083,853.100710,AFG,4
3,Afghanistan,Asia,1967,34.020,11537966,836.197138,AFG,4
4,Afghanistan,Asia,1972,36.088,13079460,739.981106,AFG,4

### Viewing the first five rows of a data frame.

In [6]:
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

### Viewing the last five rows of a data frame.

In [7]:
df.tail()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311
27,1/28/2016,37,20,51,29.90,10,5.0,0,1,NaN,234
28,1/29/2016,36,21,50,29.58,10,8.0,0,4,NaN,298
29,1/30/2016,34,16,46,30.01,10,7.0,0,0,NaN,257
30,1/31/2016,46,28,52,29.90,10,5.0,0,0,NaN,241

### Quick inspection of a data frame

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   EST                   31 non-null     object
 1   Temperature           31 non-null     int64
 2   DewPoint              31 non-null     int64
 3   Humidity              31 non-null     int64
 4   Sea Level PressureIn  31 non-null     float64
 5   VisibilityMiles       31 non-null     int64
 6   WindSpeedMPH          28 non-null     float64
 7   PrecipitationIn       31 non-null     object
 8   CloudCover            31 non-null     int64
 9   Events                9 non-null      object
 10  WindDirDegrees        31 non-null     int64
dtypes: float64(2), int64(6), object(3)
memory usage: 2.8+ KB

In [9]:
df.Events.unique()

array([nan, 'Rain', 'Fog-Snow', 'Snow'], dtype=object)

### Looking at the summary of a dataframe

In [10]:
df.describe()

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,CloudCover,WindDirDegrees
count,31.000000,31.000000,31.000000,31.000000,31.000000,28.000000,31.000000,31.000000
mean,34.677419,17.838710,51.677419,29.992903,9.193548,6.892857,3.129032,247.129032
std,7.639315,11.378626,11.634395,0.237237,1.939405,2.871821,2.629853,92.308086
min,20.000000,-3.000000,33.000000,29.520000,1.000000,2.000000,0.000000,34.000000
25%,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,1.000000,238.000000
50%,35.000000,18.000000,50.000000,30.010000,10.000000,6.500000,3.000000,281.000000
75%,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,4.500000,300.000000
max,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,8.000000,345.000000

In [11]:
### Taking a summary of the categocal columns alone
df.describe(include = 'object')

             EST PrecipitationIn Events
count         31              31      9
unique        31               7      3
top     1/9/2016               0   Rain
freq           1              19      4

In [12]:
### Taking a summary of the numerical columns alone
df.describe(include = np.number)

,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,CloudCover,WindDirDegrees
count,31.000000,31.000000,31.000000,31.000000,31.000000,28.000000,31.000000,31.000000
mean,34.677419,17.838710,51.677419,29.992903,9.193548,6.892857,3.129032,247.129032
std,7.639315,11.378626,11.634395,0.237237,1.939405,2.871821,2.629853,92.308086
min,20.000000,-3.000000,33.000000,29.520000,1.000000,2.000000,0.000000,34.000000
25%,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,1.000000,238.000000
50%,35.000000,18.000000,50.000000,30.010000,10.000000,6.500000,3.000000,281.000000
75%,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,4.500000,300.000000
max,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,8.000000,345.000000

In [13]:
## Taking a summary of all data types
df.describe(include = 'all')

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
count,31,31.000000,31.000000,31.000000,31.000000,31.000000,28.000000,31,31.000000,9,31.000000
unique,31,NaN,NaN,NaN,NaN,NaN,NaN,7,NaN,3,NaN
top,1/9/2016,NaN,NaN,NaN,NaN,NaN,NaN,0,NaN,Rain,NaN
freq,1,NaN,NaN,NaN,NaN,NaN,NaN,19,NaN,4,NaN
mean,NaN,34.677419,17.838710,51.677419,29.992903,9.193548,6.892857,NaN,3.129032,NaN,247.129032
std,NaN,7.639315,11.378626,11.634395,0.237237,1.939405,2.871821,NaN,2.629853,NaN,92.308086
min,NaN,20.000000,-3.000000,33.000000,29.520000,1.000000,2.000000,NaN,0.000000,NaN,34.000000
25%,NaN,29.000000,10.000000,44.500000,29.855000,9.000000,5.000000,NaN,1.000000,NaN,238.000000
50%,NaN,35.000000,18.000000,50.000000,30.010000,10.000000,6.500000,NaN,3.000000,NaN,281.000000
75%,NaN,39.500000,23.000000,55.000000,30.140000,10.000000,8.000000,NaN,4.500000,NaN,300.000000
max,NaN,50.000000,46.000000,78.000000,30.570000,10.000000,16.000000,NaN,8.000000,NaN,345.000000

### Checking the shape of a data frame

In [14]:
df.shape

(31, 11)

### Viewing(printing) columns of a data frame

In [15]:
df.columns

Index(['EST', 'Temperature', 'DewPoint', 'Humidity', 'Sea Level PressureIn',
       'VisibilityMiles', 'WindSpeedMPH', 'PrecipitationIn', 'CloudCover',
       'Events', 'WindDirDegrees'],
      dtype='object')

In [16]:
for col in df.columns:
    print(col)

EST
Temperature
DewPoint
Humidity
Sea Level PressureIn
VisibilityMiles
WindSpeedMPH
PrecipitationIn
CloudCover
Events
WindDirDegrees

### Renaming a column
 you can rename a column using the rename method

In [48]:
# rename WindDirDegrees as Wind_Direction with default inplace = False
df.rename(columns={'WindDirDegrees':'Wind_Direction'}).head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,Random_values,WindSpeedMPH,PrecipitationIn,CloudCover,Events,Wind_Direction,New_temperature,Scaler
0,1/1/2016,38,23,52,30.03,10,19,8.0,0,5,NaN,281,28,100
1,1/2/2016,36,18,46,30.02,10,11,7.0,0,3,NaN,275,26,100
2,1/3/2016,40,21,47,29.86,10,19,8.0,0,1,NaN,277,30,100
3,1/4/2016,25,9,44,30.05,10,19,9.0,0,3,NaN,345,15,100
4,1/5/2016,20,-3,41,30.57,10,24,5.0,0,0,NaN,333,10,100

In [18]:
#Checking if the column name has changed in the original data. 

for col in df.columns:
    print(col)

EST
Temperature
DewPoint
Humidity
Sea Level PressureIn
VisibilityMiles
WindSpeedMPH
PrecipitationIn
CloudCover
Events
WindDirDegrees

In [19]:
# rename WindDirDegrees as Wind_Direction with inplace =True
df.rename(columns={'WindDirDegrees':'Wind_Direction'},inplace=True)

In [20]:
#Checking if the column name has changed in the original data.
for col in df.columns:
    print(col)

EST
Temperature
DewPoint
Humidity
Sea Level PressureIn
VisibilityMiles
WindSpeedMPH
PrecipitationIn
CloudCover
Events
Wind_Direction

### selecting  a column (method 1)

In [21]:
df['Temperature']

0     38
1     36
2     40
3     25
4     20
5     33
6     39
7     39
8     44
9     50
10    33
11    35
12    26
13    30
14    43
15    47
16    36
17    25
18    22
19    32
20    31
21    26
22    26
23    28
24    34
25    43
26    41
27    37
28    36
29    34
30    46
Name: Temperature, dtype: int64

#### Selecting a column (method 2)

In [22]:
df.Temperature

0     38
1     36
2     40
3     25
4     20
5     33
6     39
7     39
8     44
9     50
10    33
11    35
12    26
13    30
14    43
15    47
16    36
17    25
18    22
19    32
20    31
21    26
22    26
23    28
24    34
25    43
26    41
27    37
28    36
29    34
30    46
Name: Temperature, dtype: int64

In [23]:
df['Wind_Direction']

0     281
1     275
2     277
3     345
4     333
5     259
6     293
7      79
8      76
9     109
10    289
11    235
12    284
13    266
14    101
15    340
16    345
17    293
18    293
19    302
20    312
21     34
22     42
23    327
24    286
25    244
26    311
27    234
28    298
29    257
30    241
Name: Wind_Direction, dtype: int64

In [24]:
df.Wind_Direction

0     281
1     275
2     277
3     345
4     333
5     259
6     293
7      79
8      76
9     109
10    289
11    235
12    284
13    266
14    101
15    340
16    345
17    293
18    293
19    302
20    312
21     34
22     42
23    327
24    286
25    244
26    311
27    234
28    298
29    257
30    241
Name: Wind_Direction, dtype: int64

### Adding a new column

In [25]:
# Adding a new column called New_temperature (Temperature -10)
df['New_temperature'] = df['Temperature']-10

In [26]:
df.New_temperature

0     28
1     26
2     30
3     15
4     10
5     23
6     29
7     29
8     34
9     40
10    23
11    25
12    16
13    20
14    33
15    37
16    26
17    15
18    12
19    22
20    21
21    16
22    16
23    18
24    24
25    33
26    31
27    27
28    26
29    24
30    36
Name: New_temperature, dtype: int64

In [27]:
df.head(2)

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,Wind_Direction,New_temperature
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281,28
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275,26

In [28]:
## Adding a column called Scaler thar contain 100 as values
df['Scaler'] = 100

In [29]:
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,Wind_Direction,New_temperature,Scaler
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281,28,100
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275,26,100
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277,30,100
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345,15,100
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333,10,100

In [30]:
len(df)

31

### Inserting a column

In [31]:
random_int = np.random.randint(10,30,len(df))

In [32]:
df.insert(6,'Random_values',random_int)

In [33]:
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,Random_values,WindSpeedMPH,PrecipitationIn,CloudCover,Events,Wind_Direction,New_temperature,Scaler
0,1/1/2016,38,23,52,30.03,10,19,8.0,0,5,NaN,281,28,100
1,1/2/2016,36,18,46,30.02,10,11,7.0,0,3,NaN,275,26,100
2,1/3/2016,40,21,47,29.86,10,19,8.0,0,1,NaN,277,30,100
3,1/4/2016,25,9,44,30.05,10,19,9.0,0,3,NaN,345,15,100
4,1/5/2016,20,-3,41,30.57,10,24,5.0,0,0,NaN,333,10,100

## Viewing the unique values of a column

In [34]:
df['Events'].unique()

array([nan, 'Rain', 'Fog-Snow', 'Snow'], dtype=object)

### Viewing the number unique values of a column

In [35]:
df['Events'].nunique()

3

## Indexing and boolean indexing

In [36]:
mask = df['Events']== 'Rain'

In [37]:
mask

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9      True
10    False
11    False
12    False
13    False
14    False
15     True
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26     True
27    False
28    False
29    False
30    False
Name: Events, dtype: bool

In [38]:
df['EST'][mask]

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [39]:
lambda df:df['Events']== 'Rain'

In [40]:
df['EST'][df['Events']== 'Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [41]:
df[df['Events']== 'Rain']['EST']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [42]:
df[['EST','Humidity']][df['Events']== 'Rain']

          EST  Humidity
8    1/9/2016        77
9   1/10/2016        71
15  1/16/2016        70
26  1/27/2016        45

In [43]:
df[df['Events']== 'Rain'][['EST','Humidity']]

          EST  Humidity
8    1/9/2016        77
9   1/10/2016        71
15  1/16/2016        70
26  1/27/2016        45

#### Getting the average wind speed

In [44]:
df['WindSpeedMPH'].mean()

6.892857142857143

In [45]:
np.round(df['WindSpeedMPH'].mean(),2)

6.89

In [46]:
# df['WindSpeedMPH'].fillna(0,inplace=True)

#### Data set 1

In [49]:
df1 =pd.read_csv('data/weather_data.csv')

In [50]:
df1.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

## Indexing and slicing with loc and iloc

In [51]:
df1.index

RangeIndex(start=0, stop=6, step=1)

In [52]:
df1.index.to_list()

[0, 1, 2, 3, 4, 5]

In [53]:
df1.loc[0:3]

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow

In [54]:
df1.loc[2:]

        day  temperature  windspeed  event
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [55]:
df1.loc[2,'temperature']

28

In [56]:
df1.loc[4,'windspeed']

4

In [57]:
df1.loc[3,'day']

'1/4/2017'

In [58]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          6 non-null      object
 1   temperature  6 non-null      int64
 2   windspeed    6 non-null      int64
 3   event        6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [59]:
df1.loc[0:2,['temperature','windspeed']]

   temperature  windspeed
0           32          6
1           35          7
2           28          2

In [60]:
df1.loc[df1['temperature']== df1['temperature'].min(), ['event','windspeed']]

  event  windspeed
3  Snow          7

In [61]:
df1.loc[df1['windspeed']== df1['windspeed'].min(), ['event','temperature']]

   event  temperature
2   Snow           28
5  Sunny           31

In [62]:
df1[['day','event']][df1['temperature'] ==32]

        day event
0  1/1/2017  Rain
4  1/5/2017  Rain

In [63]:
df1[['windspeed','event','temperature']][df1['temperature'] == df1['temperature'].max()]

   windspeed  event  temperature
1          7  Sunny           35

In [64]:
df1['event'][df1['windspeed'] == df1['windspeed'].max()]

1    Sunny
3     Snow
Name: event, dtype: object

In [65]:
df1.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [66]:
df1.loc[4,'temperature']

32

In [67]:
df1.loc[3:5,['temperature','event']]

   temperature  event
3           24   Snow
4           32   Rain
5           31  Sunny

### converting a string columns to date coulumn

In [68]:
df1['day']= pd.to_datetime(df1['day'])

In [69]:
df1['day']

0   2017-01-01
1   2017-01-02
2   2017-01-03
3   2017-01-04
4   2017-01-05
5   2017-01-06
Name: day, dtype: datetime64[ns]

In [70]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          6 non-null      datetime64[ns]
 1   temperature  6 non-null      int64
 2   windspeed    6 non-null      int64
 3   event        6 non-null      object
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 320.0+ bytes

In [71]:
df1['day'][0]

Timestamp('2017-01-01 00:00:00')

In [72]:
type(df1['day'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [73]:
df1['day'].dtype

dtype('<M8[ns]')

###  Dataframe index

In [74]:
df1.index

RangeIndex(start=0, stop=6, step=1)

In [75]:
df1.index.to_list()

[0, 1, 2, 3, 4, 5]

### setting a column as index

In [76]:
df1.set_index('day',inplace = True)

In [77]:
df1

            temperature  windspeed  event
day
2017-01-01           32          6   Rain
2017-01-02           35          7  Sunny
2017-01-03           28          2   Snow
2017-01-04           24          7   Snow
2017-01-05           32          4   Rain
2017-01-06           31          2  Sunny

In [78]:
df1.loc['2017-01-06','temperature']

31

In [79]:
df1.reset_index(0,inplace = True)

In [80]:
df1

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02           35          7  Sunny
2 2017-01-03           28          2   Snow
3 2017-01-04           24          7   Snow
4 2017-01-05           32          4   Rain
5 2017-01-06           31          2  Sunny

In [81]:
df1.set_index('day',inplace = True)

In [82]:
df1.index.name

'day'

In [83]:
df1.index.name = 'Date'

In [84]:
df1.index.name

'Date'

In [85]:
df1

            temperature  windspeed  event
Date
2017-01-01           32          6   Rain
2017-01-02           35          7  Sunny
2017-01-03           28          2   Snow
2017-01-04           24          7   Snow
2017-01-05           32          4   Rain
2017-01-06           31          2  Sunny

### iloc

In [87]:
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,Random_values,WindSpeedMPH,PrecipitationIn,CloudCover,Events,Wind_Direction,New_temperature,Scaler
0,1/1/2016,38,23,52,30.03,10,19,8.0,0,5,NaN,281,28,100
1,1/2/2016,36,18,46,30.02,10,11,7.0,0,3,NaN,275,26,100
2,1/3/2016,40,21,47,29.86,10,19,8.0,0,1,NaN,277,30,100
3,1/4/2016,25,9,44,30.05,10,19,9.0,0,3,NaN,345,15,100
4,1/5/2016,20,-3,41,30.57,10,24,5.0,0,0,NaN,333,10,100

In [88]:
df.iloc[1:5,0]

1    1/2/2016
2    1/3/2016
3    1/4/2016
4    1/5/2016
Name: EST, dtype: object

In [89]:
df.iloc[10:15,[0,5]]

          EST  VisibilityMiles
10  1/11/2016               10
11  1/12/2016               10
12  1/13/2016               10
13  1/14/2016               10
14  1/15/2016                9

In [90]:
df.iloc[1:5,0:4]

        EST  Temperature  DewPoint  Humidity
1  1/2/2016           36        18        46
2  1/3/2016           40        21        47
3  1/4/2016           25         9        44
4  1/5/2016           20        -3        41

In [91]:
df.iloc[[1,5],0:4]

        EST  Temperature  DewPoint  Humidity
1  1/2/2016           36        18        46
5  1/6/2016           33         4        35

In [92]:
df1.iloc[0]

temperature      32
windspeed         6
event          Rain
Name: 2017-01-01 00:00:00, dtype: object

### Data set 3

In [94]:
df2 =pd.read_csv('data/stock_data.csv',skiprows=1)
df2

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [95]:
df =pd.read_csv('data/stock_data.csv',
                na_values={'eps':['not available','n.a.'],
                                                      'revenue':['not available','n.a.',-1],
                                                      'price':['not available','n.a.'],
                                                      'people':['not available','n.a.']})
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

### Saving a dataframe in a .csv format

In [96]:
df.to_csv('data/new.csv',index=False,columns=['people','price','revenue'])

### Reading an excel file and making  convertions

In [97]:
def converters_people(cell):
    if cell == "n.a.":
        return "sam walton"
    return cell

In [98]:
df = pd.read_excel("data/stock_data.xlsx","Sheet1",converters = {'people':converters_people})
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65     sam walton
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

### Saving a dataframe to in .xlsx format

In [99]:
df.to_excel("data/new.xlsx","Sheet1",index=False)

In [101]:
df = pd.read_excel("data/stocks_weather.xlsx")
df

  tickets  price     pe    eps
0   GOODL    845  30.37  27.82
1     WIT     65  14.26   4.61
2    NSFT     64  30.97   2.12

In [102]:
df_stocks = pd.DataFrame({'tickets':['GOODL','WIT','NSFT'],
                         'price':[845,65,64],
                         'pe':[30.37,14.26,30.97],
                         'eps':[27.82,4.61,2.12]})

In [103]:
df_weather = pd.DataFrame({'day':['1/1/2017','1/2/2017','1/3/2017'],
                          'temperature':[32,35,28],
                          'event':['Rain','Sunny','Snow']})

In [104]:
with pd.ExcelWriter('data/stocks_weather.xlsx') as book:
    df_stocks.to_excel(book,sheet_name='stocks',index=False)
    df_weather.to_excel(book,sheet_name = 'weather',index=False)
    index=False

In [105]:
df = pd.read_excel("data/stocks_weather.xlsx","weather")
df

        day  temperature  event
0  1/1/2017           32   Rain
1  1/2/2017           35  Sunny
2  1/3/2017           28   Snow

In [106]:
print(type(df["day"][0]))

<class 'str'>

### Reading data and parsing strings as dates

In [107]:
df = pd.read_csv("data/weather_data_na.csv",parse_dates=["day"])
df

         day  temperature  windspeed   event
0 2017-01-01         32.0        6.0    Rain
1 2017-01-04          NaN        9.0   Sunny
2 2017-01-05         28.0        NaN    Snow
3 2017-01-06          NaN        7.0     NaN
4 2017-01-07         32.0        NaN    Rain
5 2017-01-08          NaN        NaN   Sunny
6 2017-01-09          NaN        NaN     NaN
7 2017-01-10         34.0        8.0  Cloudy
8 2017-01-11         40.0       12.0   Sunny

In [108]:
print(type(df["day"][0]))

<class 'pandas._libs.tslibs.timestamps.Timestamp'>

# Data Cleaning

### Finding missing values

In [109]:
df = pd.read_csv("data/weather_data_na.csv")
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [110]:
df.isnull()

     day  temperature  windspeed  event
0  False        False      False  False
1  False         True      False  False
2  False        False       True  False
3  False         True      False   True
4  False        False       True  False
5  False         True       True  False
6  False         True       True   True
7  False        False      False  False
8  False        False      False  False

In [111]:
# Number of missing values in each column
df.isnull().sum()

day            0
temperature    4
windspeed      4
event          2
dtype: int64

In [112]:
#Number of missing values in the entire dataframe
df.isnull().sum().sum()

10

## Dealing with missing values

### Replacing missing values

In [113]:
# Replacing all missing values with 0
new_df= df.fillna(0)
new_df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          0.0        9.0   Sunny
2   1/5/2017         28.0        0.0    Snow
3   1/6/2017          0.0        7.0       0
4   1/7/2017         32.0        0.0    Rain
5   1/8/2017          0.0        0.0   Sunny
6   1/9/2017          0.0        0.0       0
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [114]:
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [115]:
# Replacing missing values in each column with different values 
new_df= df.fillna({'temperature':0,
                   'windspeed':0,
                  'event':'no event'})
new_df

         day  temperature  windspeed     event
0   1/1/2017         32.0        6.0      Rain
1   1/4/2017          0.0        9.0     Sunny
2   1/5/2017         28.0        0.0      Snow
3   1/6/2017          0.0        7.0  no event
4   1/7/2017         32.0        0.0      Rain
5   1/8/2017          0.0        0.0     Sunny
6   1/9/2017          0.0        0.0  no event
7  1/10/2017         34.0        8.0    Cloudy
8  1/11/2017         40.0       12.0     Sunny

In [116]:
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [117]:
#Replacing missing values with backward values
new_df = df.fillna(method='bfill',limit =2)
new_df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017         28.0        9.0   Sunny
2   1/5/2017         28.0        7.0    Snow
3   1/6/2017         32.0        7.0    Rain
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017         34.0        8.0   Sunny
6   1/9/2017         34.0        8.0  Cloudy
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [118]:
#Replacing missing values with backward values
new_df = df.fillna(method='ffill',limit =2)
new_df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017         32.0        9.0   Sunny
2   1/5/2017         28.0        9.0    Snow
3   1/6/2017         28.0        7.0    Snow
4   1/7/2017         32.0        7.0    Rain
5   1/8/2017         32.0        7.0   Sunny
6   1/9/2017         32.0        NaN   Sunny
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [119]:
#Replacing missing values using interpolation methrod
new_df = df.interpolate(methoed='time')
print(new_df)
new_df['temperature'] = np.round(new_df['temperature'],0)
print()
new_df

         day  temperature  windspeed   event
0   1/1/2017    32.000000       6.00    Rain
1   1/4/2017    30.000000       9.00   Sunny
2   1/5/2017    28.000000       8.00    Snow
3   1/6/2017    30.000000       7.00     NaN
4   1/7/2017    32.000000       7.25    Rain
5   1/8/2017    32.666667       7.50   Sunny
6   1/9/2017    33.333333       7.75     NaN
7  1/10/2017    34.000000       8.00  Cloudy
8  1/11/2017    40.000000      12.00   Sunny

         day  temperature  windspeed   event
0   1/1/2017         32.0       6.00    Rain
1   1/4/2017         30.0       9.00   Sunny
2   1/5/2017         28.0       8.00    Snow
3   1/6/2017         30.0       7.00     NaN
4   1/7/2017         32.0       7.25    Rain
5   1/8/2017         33.0       7.50   Sunny
6   1/9/2017         33.0       7.75     NaN
7  1/10/2017         34.0       8.00  Cloudy
8  1/11/2017         40.0      12.00   Sunny

### Dropping missing values

In [120]:
new_df = df.dropna(how='all',axis = 0)
new_df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [121]:
new_df=df.dropna(how='any',axis = 1)
new_df

         day
0   1/1/2017
1   1/4/2017
2   1/5/2017
3   1/6/2017
4   1/7/2017
5   1/8/2017
6   1/9/2017
7  1/10/2017
8  1/11/2017

In [122]:
new_df=df.dropna(how='any',axis =0)
new_df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

## Use the replace function to deal missing data

In [123]:
df= pd.read_csv('data/weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [124]:
df.loc[4,'temperature'] = -99999

In [125]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017       -99999          4   Rain
5  1/6/2017           31          2  Sunny

In [126]:
new_df = df.replace(-99999,np.nan)
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0          6   Rain
1  1/2/2017         35.0          7  Sunny
2  1/3/2017         28.0          2   Snow
3  1/4/2017         24.0          7   Snow
4  1/5/2017          NaN          4   Rain
5  1/6/2017         31.0          2  Sunny

In [127]:
new_df['temperature'].sum()/6 # including missing values

25.0

In [128]:
new_df['temperature'].sum()/5 # Excluding missin values

30.0

In [129]:
new_df['temperature'].mean() # pandas by default exlude missing values

30.0

In [ ]:
# Checking for stray values

In [ ]:
# Dealing with stary values

In [ ]:
# Data formatting

In [ ]:
# Dealinng with duplicates

In [ ]:
# Data transformation

In [ ]:
# Tidy data